In [3]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
import webbrowser

In [5]:
webbrowser.open('https://en.wikipedia.org/wiki/NFL_win%E2%80%93loss_records')
#copy the table on the website

True

# read data from clipboard

In [69]:
nfl_frame = pd.read_clipboard()
#solve the problem: cell value has space split into two cells
nfl_frame.columns = nfl_frame.columns.str.strip()

In [70]:
nfl_frame

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East
5,6,New York Giants,684,572,33,0.543,1925,"1,289",NFC East
6,7,Denver Broncos,465,393,10,0.541,1960,868,AFC West
7,8,Minnesota Vikings,457,387,10,0.541,1961,854,NFC North
8,9,Baltimore Ravens,181,154,1,0.540,1996,336,AFC North
9,10,San Francisco 49ers,522,450,14,0.537,1950,986,NFC West

In [71]:
nfl_frame.columns

Index(['Rank', 'Team', 'Won', 'Lost', 'Tied', 'Pct.', 'First NFL Season',
       'Total Games', 'Division'],
      dtype='object')

In [72]:
nfl_frame['First NFL Season'] #or dot Team

0    1960
1    1921
2    1920
3    1966
4    1960
5    1925
6    1960
7    1961
8    1996
9    1950
Name: First NFL Season, dtype: int64

In [73]:
nfl_frame.loc[0]

Rank                             1
Team                Dallas Cowboys
Won                            493
Lost                           367
Tied                             6
Pct.                         0.573
First NFL Season              1960
Total Games                    866
Division                  NFC East
Name: 0, dtype: object

In [74]:
new_nfl_frame = DataFrame(nfl_table.head(5),columns=['Team','Won','Lost','NaN'])
new_nfl_frame

                   Team  Won  Lost  NaN
0        Dallas Cowboys  493   367  NaN
1     Green Bay Packers  730   553  NaN
2         Chicago Bears  744   568  NaN
3        Miami Dolphins  439   341  NaN
4  New England Patriots  476   383  NaN

In [75]:
new_nfl_frame['NaN'] = np.arange(5)
new_nfl_frame

                   Team  Won  Lost  NaN
0        Dallas Cowboys  493   367    0
1     Green Bay Packers  730   553    1
2         Chicago Bears  744   568    2
3        Miami Dolphins  439   341    3
4  New England Patriots  476   383    4

In [76]:
new_nfl_frame['NaN'] = Series(['NewValue1','NewValue2'],index=[1,3])
new_nfl_frame

                   Team  Won  Lost        NaN
0        Dallas Cowboys  493   367        NaN
1     Green Bay Packers  730   553  NewValue1
2         Chicago Bears  744   568        NaN
3        Miami Dolphins  439   341  NewValue2
4  New England Patriots  476   383        NaN

In [77]:
del new_nfl_frame['NaN']
new_nfl_frame

                   Team  Won  Lost
0        Dallas Cowboys  493   367
1     Green Bay Packers  730   553
2         Chicago Bears  744   568
3        Miami Dolphins  439   341
4  New England Patriots  476   383

In [68]:
# create DataFrame normal way
data = {'City':['Taiwan','USA','EastLand'],'Rank':[1,2,3]}
test_frame = DataFrame(data)
test_frame

       City  Rank
0    Taiwan     1
1       USA     2
2  EastLand     3